app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(params[:id])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 1)