app/controllers/gigs_controller.rb

SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)
---
  def show
    @gig = Gig.find(params[:id])

INSERT INTO "gigs" ("artist_id", "updated_at", "price", "date", "sold_out", "venue_id", "door_open", "created_at") VALUES(1, '2009-03-04 11:27:17', 25.0, '2009-04-23', 'f', 4, '2009-04-23 20:30:00', '2009-03-04 11:27:17')
---
  def create
    @gig = Gig.new(params[:gig])

    respond_to do |format|
      if @gig.save