app/controllers/ticket_sellers_controller.rb

SELECT * FROM "ticket_sellers" WHERE ("ticket_sellers"."id" = 1)
---
  def show
    @ticket_seller = TicketSeller.find(params[:id])

INSERT INTO "ticket_sellers" ("name", "updated_at", "address_id", "phone", "web", "email", "created_at") VALUES('Polyester', '2009-03-04 11:19:43', NULL, '', '', '', '2009-03-04 11:19:43')
---
  def create
    @ticket_seller = TicketSeller.new(params[:ticket_seller])

    respond_to do |format|
      if @ticket_seller.save